python3/pandas_v2.org
#+TITLE:     Pandas
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 4
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
#+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: </div>

#+BEGIN_SRC ipython :session :exports none :eval never-export
  #! /usr/bin/env python3
  # -*- coding: utf-8 -*-


  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
  import subprocess
  from PIL import Image

  def run_script(script):
      """Returns (stdout, stderr), raises error on non-zero return code"""
      proc = subprocess.Popen(['bash', '-c', script],
                              stdout=subprocess.PIPE, stderr=subprocess.PIPE,
                              stdin=subprocess.PIPE)
      stdout, stderr = proc.communicate()
      if proc.returncode:
          raise Exception('exit code %s' % proc.returncode)
      return stdout, stderr

  def show_dataframe(df):
      global path
      df.to_html("/tmp/df.html")
      run_script('webkit2png -F --transparent /tmp/df.html -D /tmp -o df')
      # try:
      #     subprocess.call('webkit2png -F --transparent /tmp/df.html -D /tmp -o df', shell=True, timeout=5)
      # except:
      #     pass
      image = Image.open('/tmp/df-full.png')
      box = image.getbbox()
      cropped = image.crop(box)
      image.close()
      w = cropped.size[0]
      h = cropped.size[1]
      ratio = 0.618
      cropped.thumbnail((int(w*ratio), int(h*ratio)), Image.ANTIALIAS)
      cropped.save(path)
      cropped.close()

  def plot():
      global path
      plt.savefig(path)
      plt.clf()

  def show_fig(o):
      global path
      plt.clf()
      o.plot()
      plt.savefig(path)


  def log(title0, value):
      title1 = ' ' + title0 + ' '
      print("{}\n{}".format(title1.center(80, '='), value))
#+END_SRC

#+RESULTS:
: # Out[1]:

* 核心数据结构

** 索引对象

Pandas 中的索引对象适用于存储标签和其他元数据的。

索引对象是不可变的。

[[index obj][常见方法和属性]]

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series(range(3), index=list('abc'))
  index = s.index
  log("index", index)
  log("index[1:]", index[1:])
  try:
      index[1] = 'd' # TypeError
  except Exception as e:
      log("TypeError", e)
#+END_SRC

#+RESULTS:
: ==================================== index =====================================
: Index(['a', 'b', 'c'], dtype='object')
: ================================== index[1:] ===================================
: Index(['b', 'c'], dtype='object')
: ================================== TypeError ===================================
: Index does not support mutable operations




** Panel

Panel 是三维带标签的数组。

Panel 由三个标签组成：

- items :: 坐标轴 0 ，索引对应的元素是一个 DataFrame
- major_axis :: 坐标轴 1 , DataFrame 里的行标签
- minor_axis :: 坐标轴 2 , DataFrame 里的列标签



** Series

Series 是一维带标签的数组，数组里可以放任意的数据（整数，浮点数，字符串，Python Object）。

其基本的创建函数是： =pd.Series(data, index=index)=

其中 index 是一个列表，用来作为数据的标签。data 可以是不同的数据类型：

- Python 字典
- ndarray 对象
- 一个标量值，如 5


*** 创建

**** 从 ndarray 创建

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
  log("s", s)
  log("s.index", s.index)
  s2 = pd.Series(np.random.randn(5))
  log("s2", s2)
  log("s2.index", s2.index)
#+END_SRC

#+RESULTS:
#+begin_example
====================================== s =======================================
a   -0.701251
b    1.857044
c   -0.775307
d    0.652000
e    1.178334
dtype: float64
=================================== s.index ====================================
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
====================================== s2 ======================================
0    0.393573
1   -0.042283
2    0.557877
3    2.094997
4    0.671984
dtype: float64
=================================== s2.index ===================================
RangeIndex(start=0, stop=5, step=1)
#+end_example


**** 从字典创建

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  d = {'a' : 0., 'b' : 1., 'd' : 3}
  s = pd.Series(d, index=list('abcd'))
  log("s", s)
#+END_SRC

#+RESULTS:
: ====================================== s =======================================
: a    0.0
: b    1.0
: c    NaN
: d    3.0
: dtype: float64


**** 从标量创建

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series(3, index=list('abcde'))
  log("s", s)
#+END_SRC

#+RESULTS:
: ====================================== s =======================================
: a    3
: b    3
: c    3
: d    3
: e    3
: dtype: int64


*** 操作

**** 赋值

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
  log("s", s)
  s['b':'a'] = 5
  log("s", s)
#+END_SRC

#+RESULTS:
#+begin_example
====================================== s =======================================
d    4
b    7
a   -5
c    3
dtype: int64
====================================== s =======================================
d    4
b    5
a    5
c    3
dtype: int64
#+end_example


