python3/pandas_v2.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-09-20 Thu 00:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Pandas</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Pandas</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde9d6e2">1. 核心数据结构</a>
<ul>
<li><a href="#orgfc91c4d">1.1. 索引对象</a></li>
<li><a href="#org90d6d77">1.2. Panel</a></li>
<li><a href="#org498b57d">1.3. Series</a>
<ul>
<li><a href="#org4fab2d5">1.3.1. 数据创建</a>
<ul>
<li><a href="#org3411edc">1.3.1.1. 从 ndarray 创建</a></li>
<li><a href="#orgdb83944">1.3.1.2. 从字典创建</a></li>
<li><a href="#org5e6c583">1.3.1.3. 从标量创建</a></li>
</ul>
</li>
<li><a href="#org9357cea">1.3.2. 数据操作</a>
<ul>
<li><a href="#org2508984">1.3.2.1. 索引对齐</a></li>
<li><a href="#org294453e">1.3.2.2. 获取值和索引</a></li>
<li><a href="#orgd966a7b">1.3.2.3. 使用布尔值数组过滤</a></li>
<li><a href="#org3ae79c3">1.3.2.4. 与标量相乘</a></li>
<li><a href="#org962ee6b">1.3.2.5. 应用数学函数</a></li>
<li><a href="#org4b535e7">1.3.2.6. 在字典上下文中使用</a></li>
<li><a href="#orgffe8414">1.3.2.7. 检查缺失数据</a></li>
<li><a href="#org06a47d5">1.3.2.8. 设置对象自身和索引的 name 属性</a></li>
</ul>
</li>
<li><a href="#orgd78b295">1.3.3. 数据索引</a>
<ul>
<li><a href="#org7122c1c">1.3.3.1. 重建索引</a></li>
<li><a href="#orgabd3c71">1.3.3.2. 使用标签进行索引</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4dfd062">1.4. DataFrame</a>
<ul>
<li><a href="#org80db341">1.4.1. 数据创建</a></li>
<li><a href="#orgac1c340">1.4.2. 数据操作</a>
<ul>
<li><a href="#orga9717ae">1.4.2.1. 转置</a></li>
<li><a href="#orgc5df83a">1.4.2.2. 设置行/列索引的 name 属性</a></li>
<li><a href="#org6bf11d3">1.4.2.3. 列赋值</a></li>
<li><a href="#org4611599">1.4.2.4. 删除列</a></li>
</ul>
</li>
<li><a href="#org0195e46">1.4.3. 数据索引</a>
<ul>
<li><a href="#orgd2f9e97">1.4.3.1. 重建索引</a></li>
<li><a href="#org8cca113">1.4.3.2. 列索引</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0a05c46">2. 附录</a>
<ul>
<li><a href="#org8a299ea">2.1. reindex 方法的参数 </a></li>
<li><a href="#orgcf89d46">2.2. 索引对象常见方法和属性 </a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde9d6e2">1. 核心数据结构</a>
<ul>
<li><a href="#orgfc91c4d">1.1. 索引对象</a></li>
<li><a href="#org90d6d77">1.2. Panel</a></li>
<li><a href="#org498b57d">1.3. Series</a>
<ul>
<li><a href="#org4fab2d5">1.3.1. 数据创建</a>
<ul>
<li><a href="#org3411edc">1.3.1.1. 从 ndarray 创建</a></li>
<li><a href="#orgdb83944">1.3.1.2. 从字典创建</a></li>
<li><a href="#org5e6c583">1.3.1.3. 从标量创建</a></li>
</ul>
</li>
<li><a href="#org9357cea">1.3.2. 数据操作</a>
<ul>
<li><a href="#org2508984">1.3.2.1. 索引对齐</a></li>
<li><a href="#org294453e">1.3.2.2. 获取值和索引</a></li>
<li><a href="#orgd966a7b">1.3.2.3. 使用布尔值数组过滤</a></li>
<li><a href="#org3ae79c3">1.3.2.4. 与标量相乘</a></li>
<li><a href="#org962ee6b">1.3.2.5. 应用数学函数</a></li>
<li><a href="#org4b535e7">1.3.2.6. 在字典上下文中使用</a></li>
<li><a href="#orgffe8414">1.3.2.7. 检查缺失数据</a></li>
<li><a href="#org06a47d5">1.3.2.8. 设置对象自身和索引的 name 属性</a></li>
</ul>
</li>
<li><a href="#orgd78b295">1.3.3. 数据索引</a>
<ul>
<li><a href="#org7122c1c">1.3.3.1. 重建索引</a></li>
<li><a href="#orgabd3c71">1.3.3.2. 使用标签进行索引</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4dfd062">1.4. DataFrame</a>
<ul>
<li><a href="#org80db341">1.4.1. 数据创建</a></li>
<li><a href="#orgac1c340">1.4.2. 数据操作</a>
<ul>
<li><a href="#orga9717ae">1.4.2.1. 转置</a></li>
<li><a href="#orgc5df83a">1.4.2.2. 设置行/列索引的 name 属性</a></li>
<li><a href="#org6bf11d3">1.4.2.3. 列赋值</a></li>
<li><a href="#org4611599">1.4.2.4. 删除列</a></li>
</ul>
</li>
<li><a href="#org0195e46">1.4.3. 数据索引</a>
<ul>
<li><a href="#orgd2f9e97">1.4.3.1. 重建索引</a></li>
<li><a href="#org8cca113">1.4.3.2. 列索引</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0a05c46">2. 附录</a>
<ul>
<li><a href="#org8a299ea">2.1. reindex 方法的参数 </a></li>
<li><a href="#orgcf89d46">2.2. 索引对象常见方法和属性 </a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-09-20 00:01:00</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgde9d6e2" class="outline-2">
<h2 id="orgde9d6e2"><span class="section-number-2">1</span> 核心数据结构</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfc91c4d" class="outline-3">
<h3 id="orgfc91c4d"><span class="section-number-3">1.1</span> 索引对象</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Pandas 中的索引对象适用于存储标签和其他元数据的。
</p>

<p>
索引对象是不可变的。
</p>

<p>
<a href="#org9629cb1">常见方法和属性</a>
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series(<span style="color: #a6e22e;">range</span>(3), index=<span style="color: #a6e22e;">list</span>(<span style="color: #e6db74;">'abc'</span>))
<span style="color: #fd971f;">index</span> = s.index
log(<span style="color: #e6db74;">"index"</span>, index)
log(<span style="color: #e6db74;">"index[1:]"</span>, index[1:])
<span style="color: #f92672; font-weight: bold;">try</span>:
    <span style="color: #fd971f;">index</span>[1] = <span style="color: #e6db74;">'d'</span> <span style="color: #465457;"># </span><span style="color: #465457;">TypeError</span>
<span style="color: #f92672; font-weight: bold;">except</span> <span style="color: #66d9ef; font-weight: bold;">Exception</span> <span style="color: #f92672; font-weight: bold;">as</span> e:
    log(<span style="color: #e6db74;">"TypeError"</span>, e)
</pre>
</div>

<pre class="example">
==================================== index =====================================
Index(['a', 'b', 'c'], dtype='object')
================================== index[1:] ===================================
Index(['b', 'c'], dtype='object')
================================== TypeError ===================================
Index does not support mutable operations

</pre>
</div>
</div>




<div id="outline-container-org90d6d77" class="outline-3">
<h3 id="org90d6d77"><span class="section-number-3">1.2</span> Panel</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Panel 是三维带标签的数组。
</p>

<p>
Panel 由三个标签组成：
</p>

<dl class="org-dl">
<dt>items</dt><dd>坐标轴 0 ，索引对应的元素是一个 DataFrame</dd>
<dt>major_axis</dt><dd>坐标轴 1 , DataFrame 里的行标签</dd>
<dt>minor_axis</dt><dd>坐标轴 2 , DataFrame 里的列标签</dd>
</dl>
</div>
</div>



<div id="outline-container-org498b57d" class="outline-3">
<h3 id="org498b57d"><span class="section-number-3">1.3</span> Series</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Series 是一维带标签的数组，数组里可以放任意的数据（整数，浮点数，字符串，Python Object）。
</p>

<p>
其基本的创建函数是： <code>pd.Series(data, index=index)</code>
</p>

<p>
其中 index 是一个列表，用来作为数据的标签。data 可以是不同的数据类型：
</p>

<ul class="org-ul">
<li>Python 字典</li>
<li>ndarray 对象</li>
<li>一个标量值，如 5</li>
</ul>
</div>


<div id="outline-container-org4fab2d5" class="outline-4">
<h4 id="org4fab2d5"><span class="section-number-4">1.3.1</span> 数据创建</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<div id="outline-container-org3411edc" class="outline-5">
<h5 id="org3411edc"><span class="section-number-5">1.3.1.1</span> 从 ndarray 创建</h5>
<div class="outline-text-5" id="text-1-3-1-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series(np.random.randn(5), index=[<span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'c'</span>, <span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'e'</span>])
log(<span style="color: #e6db74;">"s"</span>, s)
log(<span style="color: #e6db74;">"s.index"</span>, s.index)
<span style="color: #fd971f;">s2</span> = pd.Series(np.random.randn(5))
log(<span style="color: #e6db74;">"s2"</span>, s2)
log(<span style="color: #e6db74;">"s2.index"</span>, s2.index)
</pre>
</div>

<pre class="example">
====================================== s =======================================
a   -0.701251
b    1.857044
c   -0.775307
d    0.652000
e    1.178334
dtype: float64
=================================== s.index ====================================
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
====================================== s2 ======================================
0    0.393573
1   -0.042283
2    0.557877
3    2.094997
4    0.671984
dtype: float64
=================================== s2.index ===================================
RangeIndex(start=0, stop=5, step=1)
</pre>
</div>
</div>


<div id="outline-container-orgdb83944" class="outline-5">
<h5 id="orgdb83944"><span class="section-number-5">1.3.1.2</span> 从字典创建</h5>
<div class="outline-text-5" id="text-1-3-1-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">d</span> = {<span style="color: #e6db74;">'a'</span> : 0., <span style="color: #e6db74;">'b'</span> : 1., <span style="color: #e6db74;">'d'</span> : 3}
<span style="color: #fd971f;">s</span> = pd.Series(d, index=<span style="color: #a6e22e;">list</span>(<span style="color: #e6db74;">'abcd'</span>))
log(<span style="color: #e6db74;">"s"</span>, s)
</pre>
</div>

<pre class="example">
====================================== s =======================================
a    0.0
b    1.0
c    NaN
d    3.0
dtype: float64

</pre>
</div>
</div>


<div id="outline-container-org5e6c583" class="outline-5">
<h5 id="org5e6c583"><span class="section-number-5">1.3.1.3</span> 从标量创建</h5>
<div class="outline-text-5" id="text-1-3-1-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series(3, index=<span style="color: #a6e22e;">list</span>(<span style="color: #e6db74;">'abcde'</span>))
log(<span style="color: #e6db74;">"s"</span>, s)
</pre>
</div>

<pre class="example">
====================================== s =======================================
a    3
b    3
c    3
d    3
e    3
dtype: int64

</pre>
</div>
</div>
</div>
