python3/pandas_v2.org
**** 与标量相乘

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
  log("s * 2", s * 2)
#+END_SRC

#+RESULTS:
: ==================================== s * 2 =====================================
: d     8
: b    14
: a   -10
: c     6
: dtype: int64



**** 应用数学函数

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
  log("np.exp(s)", np.exp(s))
#+END_SRC

#+RESULTS:
: ================================== np.exp(s) ===================================
: d      54.598150
: b    1096.633158
: a       0.006738
: c      20.085537
: dtype: float64


**** 在字典上下文中使用

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
  log("'b' in s", 'b' in s)
  log("'e' in s", 'e' in s)
  log("7 in s", 7 in s)
#+END_SRC

#+RESULTS:
: =================================== 'b' in s ===================================
: True
: =================================== 'e' in s ===================================
: False
: ==================================== 7 in s ====================================
: False


**** 检查缺失数据

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  data = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
  states = ['California', 'Ohio', 'Oregon', 'Texas']
  s = pd.Series(data, index=states)
  log("s", s)
  log("s.isnull()", s.isnull())
  log("s.notnull()", s.notnull())
#+END_SRC

#+RESULTS:
#+begin_example
====================================== s =======================================
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
================================== s.isnull() ==================================
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
================================= s.notnull() ==================================
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool
#+end_example




*** 索引

**** 设置对象自身和索引的 name 属性

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  data = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
  states = ['California', 'Ohio', 'Oregon', 'Texas']
  s = pd.Series(data, index=states)
  s.name = 'population'
  s.index.name = 'state'
  log("s", s)
#+END_SRC

#+RESULTS:
: ====================================== s =======================================
: state
: California        NaN
: Ohio          35000.0
: Oregon        16000.0
: Texas         71000.0
: Name: population, dtype: float64


**** 获取值和索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
  log("s", s)
  log("s.values", s.values)
  log("s.index", s.index)
#+END_SRC

#+RESULTS:
#+begin_example
====================================== s =======================================
a    0.007460
b   -0.346364
c   -1.524387
d   -0.389066
e    0.464790
dtype: float64
=================================== s.values ===================================
[ 0.00745967 -0.34636371 -1.52438655 -0.38906608  0.46479046]
=================================== s.index ====================================
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
#+end_example


**** 索引对齐

相同索引值才进行操作

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s1 = pd.Series(np.random.randint(3, size=3), index=['a', 'c', 'e'])
  s2 = pd.Series(np.random.randint(3, size=3), index=['a', 'd', 'e'])
  log("s1", s1)
  log("s2", s2)
  log("s1 + s2", s1 + s2)
#+END_SRC

#+RESULTS:
#+begin_example
====================================== s1 ======================================
a    1
c    0
e    1
dtype: int64
====================================== s2 ======================================
a    1
d    1
e    0
dtype: int64
=================================== s1 + s2 ====================================
a    2.0
c    NaN
d    NaN
e    1.0
dtype: float64
#+end_example


