python3/pandas_v2.html


<div id="outline-container-org9357cea" class="outline-4">
<h4 id="org9357cea"><span class="section-number-4">1.3.2</span> 数据操作</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
<div id="outline-container-org2508984" class="outline-5">
<h5 id="org2508984"><span class="section-number-5">1.3.2.1</span> 索引对齐</h5>
<div class="outline-text-5" id="text-1-3-2-1">
<p>
相同索引值才进行操作
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s1</span> = pd.Series(np.random.randint(3, size=3), index=[<span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'c'</span>, <span style="color: #e6db74;">'e'</span>])
<span style="color: #fd971f;">s2</span> = pd.Series(np.random.randint(3, size=3), index=[<span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'e'</span>])
log(<span style="color: #e6db74;">"s1"</span>, s1)
log(<span style="color: #e6db74;">"s2"</span>, s2)
log(<span style="color: #e6db74;">"s1 + s2"</span>, s1 + s2)
</pre>
</div>

<pre class="example">
====================================== s1 ======================================
a    1
c    0
e    1
dtype: int64
====================================== s2 ======================================
a    1
d    1
e    0
dtype: int64
=================================== s1 + s2 ====================================
a    2.0
c    NaN
d    NaN
e    1.0
dtype: float64
</pre>
</div>
</div>



<div id="outline-container-org294453e" class="outline-5">
<h5 id="org294453e"><span class="section-number-5">1.3.2.2</span> 获取值和索引</h5>
<div class="outline-text-5" id="text-1-3-2-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series(np.random.randn(5), index=[<span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'c'</span>, <span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'e'</span>])
log(<span style="color: #e6db74;">"s"</span>, s)
log(<span style="color: #e6db74;">"s.values"</span>, s.values)
log(<span style="color: #e6db74;">"s.index"</span>, s.index)
</pre>
</div>

<pre class="example">
====================================== s =======================================
a    0.007460
b   -0.346364
c   -1.524387
d   -0.389066
e    0.464790
dtype: float64
=================================== s.values ===================================
[ 0.00745967 -0.34636371 -1.52438655 -0.38906608  0.46479046]
=================================== s.index ====================================
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
</pre>
</div>
</div>


<div id="outline-container-orgd966a7b" class="outline-5">
<h5 id="orgd966a7b"><span class="section-number-5">1.3.2.3</span> 使用布尔值数组过滤</h5>
<div class="outline-text-5" id="text-1-3-2-3">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series([4, 7, -5, 3], index=[<span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'c'</span>])
log(<span style="color: #e6db74;">"s[s &gt; 0]"</span>, s[s &gt; 0])
</pre>
</div>

<pre class="example">
=================================== s[s &gt; 0] ===================================
d    4
b    7
c    3
dtype: int64

</pre>
</div>
</div>


<div id="outline-container-org3ae79c3" class="outline-5">
<h5 id="org3ae79c3"><span class="section-number-5">1.3.2.4</span> 与标量相乘</h5>
<div class="outline-text-5" id="text-1-3-2-4">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series([4, 7, -5, 3], index=[<span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'c'</span>])
log(<span style="color: #e6db74;">"s * 2"</span>, s * 2)
</pre>
</div>

<pre class="example">
==================================== s * 2 =====================================
d     8
b    14
a   -10
c     6
dtype: int64

</pre>
</div>
</div>



<div id="outline-container-org962ee6b" class="outline-5">
<h5 id="org962ee6b"><span class="section-number-5">1.3.2.5</span> 应用数学函数</h5>
<div class="outline-text-5" id="text-1-3-2-5">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series([4, 7, -5, 3], index=[<span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'c'</span>])
log(<span style="color: #e6db74;">"np.exp(s)"</span>, np.exp(s))
</pre>
</div>

<pre class="example">
================================== np.exp(s) ===================================
d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

</pre>
</div>
</div>


<div id="outline-container-org4b535e7" class="outline-5">
<h5 id="org4b535e7"><span class="section-number-5">1.3.2.6</span> 在字典上下文中使用</h5>
<div class="outline-text-5" id="text-1-3-2-6">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series([4, 7, -5, 3], index=[<span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'c'</span>])
log(<span style="color: #e6db74;">"'b' in s"</span>, <span style="color: #e6db74;">'b'</span> <span style="color: #f92672; font-weight: bold;">in</span> s)
log(<span style="color: #e6db74;">"'e' in s"</span>, <span style="color: #e6db74;">'e'</span> <span style="color: #f92672; font-weight: bold;">in</span> s)
log(<span style="color: #e6db74;">"7 in s"</span>, 7 <span style="color: #f92672; font-weight: bold;">in</span> s)
</pre>
</div>

<pre class="example">
=================================== 'b' in s ===================================
True
=================================== 'e' in s ===================================
False
==================================== 7 in s ====================================
False

</pre>
</div>
</div>


<div id="outline-container-orgffe8414" class="outline-5">
<h5 id="orgffe8414"><span class="section-number-5">1.3.2.7</span> 检查缺失数据</h5>
<div class="outline-text-5" id="text-1-3-2-7">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">data</span> = {<span style="color: #e6db74;">'Ohio'</span>: 35000, <span style="color: #e6db74;">'Texas'</span>: 71000, <span style="color: #e6db74;">'Oregon'</span>: 16000, <span style="color: #e6db74;">'Utah'</span>: 5000}
<span style="color: #fd971f;">states</span> = [<span style="color: #e6db74;">'California'</span>, <span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Oregon'</span>, <span style="color: #e6db74;">'Texas'</span>]
<span style="color: #fd971f;">s</span> = pd.Series(data, index=states)
log(<span style="color: #e6db74;">"s"</span>, s)
log(<span style="color: #e6db74;">"s.isnull()"</span>, s.isnull())
log(<span style="color: #e6db74;">"s.notnull()"</span>, s.notnull())
</pre>
</div>

<pre class="example">
====================================== s =======================================
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
================================== s.isnull() ==================================
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
================================= s.notnull() ==================================
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool
</pre>
</div>
</div>


<div id="outline-container-org06a47d5" class="outline-5">
<h5 id="org06a47d5"><span class="section-number-5">1.3.2.8</span> 设置对象自身和索引的 name 属性</h5>
<div class="outline-text-5" id="text-1-3-2-8">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">data</span> = {<span style="color: #e6db74;">'Ohio'</span>: 35000, <span style="color: #e6db74;">'Texas'</span>: 71000, <span style="color: #e6db74;">'Oregon'</span>: 16000, <span style="color: #e6db74;">'Utah'</span>: 5000}
<span style="color: #fd971f;">states</span> = [<span style="color: #e6db74;">'California'</span>, <span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Oregon'</span>, <span style="color: #e6db74;">'Texas'</span>]
<span style="color: #fd971f;">s</span> = pd.Series(data, index=states)
<span style="color: #fd971f;">s.name</span> = <span style="color: #e6db74;">'population'</span>
<span style="color: #fd971f;">s.index.name</span> = <span style="color: #e6db74;">'state'</span>
log(<span style="color: #e6db74;">"s"</span>, s)
</pre>
</div>

<pre class="example">
====================================== s =======================================
state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

</pre>
</div>
</div>
</div>
