python3/pandas_v2.org
**** 重建索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
  log("s", s)
  log("s.reindex(['a', 'b', 'c', 'd', 'e'])", s.reindex(['a', 'b', 'c', 'd', 'e']))
#+END_SRC

#+RESULTS:
#+begin_example
====================================== s =======================================
d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
===================== s.reindex(['a', 'b', 'c', 'd', 'e']) =====================
a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64
#+end_example

重建索引时插值: ([[reindex][reindex 方法的参数]])

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
  log("s", s)
  log("s.reindex(range(6), method='ffill')", s.reindex(range(6), method='ffill'))
#+END_SRC

#+RESULTS:
#+begin_example
====================================== s =======================================
0      blue
2    purple
4    yellow
dtype: object
===================== s.reindex(range(6), method='ffill') ======================
0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object
#+end_example



**** 删除索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series(np.arange(5.), index=list('abcde'))
  log("s", s)
  log("s.drop('c')", s.drop('c'))
  log("s.drop(['d', 'c'])", s.drop(['d', 'c']))
#+END_SRC

#+RESULTS:
#+begin_example
====================================== s =======================================
a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64
================================= s.drop('c') ==================================
a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64
============================== s.drop(['d', 'c']) ==============================
a    0.0
b    1.0
e    4.0
dtype: float64
#+end_example


**** 标签索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])
  log("s", s)
  log("s['a']", s['a'])
  s['d'] = 6
  log("s[['c', 'a', 'd']]", s[['c', 'a', 'd']])
  log("s['b' : 'c']", s['b' : 'c'])

#+END_SRC

#+RESULTS:
#+begin_example
====================================== s =======================================
a    4
b    7
c   -5
d    3
dtype: int64
==================================== s['a'] ====================================
4
============================== s[['c', 'a', 'd']] ==============================
c   -5
a    4
d    6
dtype: int64
================================= s['b' : 'c'] =================================
b    7
c   -5
dtype: int64
#+end_example




**** 布尔索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  s = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
  log("s[s > 0]", s[s > 0])
#+END_SRC

#+RESULTS:
: =================================== s[s > 0] ===================================
: d    4
: b    7
: c    3
: dtype: int64



** DataFrame

DataFrame 是 *二维带行索引和列索引的矩阵* 。

可以把 DataFrame 想象成一个包含 _已排序的列_ 的集合。

创建 DataFrame 的基本格式是：

#+BEGIN_SRC ipython
  pd.DataFrame(data, index=index, columns=columns)
#+END_SRC

其中 index 是行标签，=columns= 是列标签，=data= 可以是下面的数据：

- 由一维 numpy 数组，list，Series 构成的字典
- 二维 numpy 数组
- 一个 Series
- 另外的 DataFrame 对象


*** 创建


*** 操作

**** 转置

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  data = {'Nevada': {2001: 2.4, 2002: 2.9},
          'Ohio': {2001: 1.5, 2001: 1.7, 2002: 3.6}}
  df = pd.DataFrame(data)
  log("df", df)
  log("df.T", df.T)
#+END_SRC

#+RESULTS:
: ====================================== df ======================================
:       Nevada  Ohio
: 2001     2.4   1.7
: 2002     2.9   3.6
: ===================================== df.T =====================================
:         2001  2002
: Nevada   2.4   2.9
: Ohio     1.7   3.6


**** 算数运算填充

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                     columns=list('abcd'))

  df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                     columns=list('abcde'))

  log("df1", df1)
  log("df2", df2)
  log("df1 + df2", df1 + df2)
  log("df1.add(df2, fill_value=0)", df1.add(df2, fill_value=0))
#+END_SRC

#+RESULTS:
#+begin_example
===================================== df1 ======================================
     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
===================================== df2 ======================================
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0
================================== df1 + df2 ===================================
      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN
========================== df1.add(df2, fill_value=0) ==========================
      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0
#+end_example

