python3/pandas_v2.html


<div id="outline-container-orgd78b295" class="outline-4">
<h4 id="orgd78b295"><span class="section-number-4">1.3.3</span> 数据索引</h4>
<div class="outline-text-4" id="text-1-3-3">
</div>
<div id="outline-container-org7122c1c" class="outline-5">
<h5 id="org7122c1c"><span class="section-number-5">1.3.3.1</span> 重建索引</h5>
<div class="outline-text-5" id="text-1-3-3-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series([4.5, 7.2, -5.3, 3.6], index=[<span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'c'</span>])
log(<span style="color: #e6db74;">"s"</span>, s)
log(<span style="color: #e6db74;">"s.reindex(['a', 'b', 'c', 'd', 'e'])"</span>, s.reindex([<span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'c'</span>, <span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'e'</span>]))
</pre>
</div>

<pre class="example">
====================================== s =======================================
d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
===================== s.reindex(['a', 'b', 'c', 'd', 'e']) =====================
a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64
</pre>

<p>
重建索引时插值: (<a href="#orge8a9db5">reindex 方法的参数</a>)
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series([<span style="color: #e6db74;">'blue'</span>, <span style="color: #e6db74;">'purple'</span>, <span style="color: #e6db74;">'yellow'</span>], index=[0, 2, 4])
log(<span style="color: #e6db74;">"s"</span>, s)
log(<span style="color: #e6db74;">"s.reindex(range(6), method='ffill')"</span>, s.reindex(<span style="color: #a6e22e;">range</span>(6), method=<span style="color: #e6db74;">'ffill'</span>))
</pre>
</div>

<pre class="example">
====================================== s =======================================
0      blue
2    purple
4    yellow
dtype: object
===================== s.reindex(range(6), method='ffill') ======================
0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object
</pre>
</div>
</div>



<div id="outline-container-orgabd3c71" class="outline-5">
<h5 id="orgabd3c71"><span class="section-number-5">1.3.3.2</span> 使用标签进行索引</h5>
<div class="outline-text-5" id="text-1-3-3-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">s</span> = pd.Series([4, 7, -5, 3], index=[<span style="color: #e6db74;">'d'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'c'</span>])
log(<span style="color: #e6db74;">"s"</span>, s)
log(<span style="color: #e6db74;">"s['a']"</span>, s[<span style="color: #e6db74;">'a'</span>])
<span style="color: #fd971f;">s</span>[<span style="color: #e6db74;">'d'</span>] = 6
log(<span style="color: #e6db74;">"s[['c', 'a', 'd']]"</span>, s[[<span style="color: #e6db74;">'c'</span>, <span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'d'</span>]])

</pre>
</div>

<pre class="example">
====================================== s =======================================
d    4
b    7
a   -5
c    3
dtype: int64
==================================== s['a'] ====================================
-5
============================== s[['c', 'a', 'd']] ==============================
c    3
a   -5
d    6
dtype: int64
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org4dfd062" class="outline-3">
<h3 id="org4dfd062"><span class="section-number-3">1.4</span> DataFrame</h3>
<div class="outline-text-3" id="text-1-4">
<p>
DataFrame 是 <b>二维带行索引和列索引的矩阵</b> 。
</p>

<p>
可以把 DataFrame 想象成一个包含 <span class="underline">已排序的列</span> 的集合。
</p>

<p>
创建 DataFrame 的基本格式是：
</p>

<div class="org-src-container">
<pre class="src src-ipython">pd.DataFrame(data, index=index, columns=columns)
</pre>
</div>

<p>
其中 index 是行标签，=columns= 是列标签，=data= 可以是下面的数据：
</p>

<ul class="org-ul">
<li>由一维 numpy 数组，list，Series 构成的字典</li>
<li>二维 numpy 数组</li>
<li>一个 Series</li>
<li>另外的 DataFrame 对象</li>
</ul>
</div>
