python3/pandas_v2.org
**** 列赋值

当将列表或数组赋值给一个列时，长度必须和 DataFrame 的长度相匹配。

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
          'year': [2000, 2001, 2002, 2001, 2002, 2003],
          'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
  columns = ['year', 'state', 'pop']
  index = ['one', 'two', 'three', 'four', 'five', 'six']
  df = pd.DataFrame(data, columns=columns, index=index)
  df['debt'] = 16.5 # 标量赋值
  df['income'] = np.arange(6.) # 数组赋值
  log("df", df)
#+END_SRC

#+RESULTS:
: ====================================== df ======================================
:        year   state  pop  debt  income
: one    2000    Ohio  1.5  16.5     0.0
: two    2001    Ohio  1.7  16.5     1.0
: three  2002    Ohio  3.6  16.5     2.0
: four   2001  Nevada  2.4  16.5     3.0
: five   2002  Nevada  2.9  16.5     4.0
: six    2003  Nevada  3.2  16.5     5.0


将 Series 赋值给一列时，Series 的索引会按照 DataFrame 的索引重新排列。

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
  df['debt'] = val
  log("df", df)
#+END_SRC

#+RESULTS:
: ====================================== df ======================================
:        year   state  pop  debt  income
: one    2000    Ohio  1.5   NaN     0.0
: two    2001    Ohio  1.7  -1.2     1.0
: three  2002    Ohio  3.6   NaN     2.0
: four   2001  Nevada  2.4  -1.5     3.0
: five   2002  Nevada  2.9  -1.7     4.0
: six    2003  Nevada  3.2   NaN     5.0


**** 删除列

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
          'year': [2000, 2001, 2002, 2001, 2002, 2003],
          'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
  columns = ['year', 'state', 'pop']
  index = ['one', 'two', 'three', 'four', 'five', 'six']
  df = pd.DataFrame(data, columns=columns, index=index)
  del df['pop']
  yearSeries = df.pop('year')
  df.drop('state', axis='columns', inplace=True)
  log("df", df)
#+END_SRC

#+RESULTS:
: ====================================== df ======================================
: Empty DataFrame
: Columns: []
: Index: [one, two, three, four, five, six]



*** 索引

**** 设置行/列索引的 name 属性

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  data = {'Nevada': {2001: 2.4, 2002: 2.9},
          'Ohio': {2001: 1.5, 2001: 1.7, 2002: 3.6}}
  df = pd.DataFrame(data)
  df.index.name = 'year'
  df.columns.name = 'state'
  log("df", df)
#+END_SRC

#+RESULTS:
: ====================================== df ======================================
: state  Nevada  Ohio
: year
: 2001      2.4   1.7
: 2002      2.9   3.6


**** 重建索引

在 DataFrame 中， =reindex= 可以改变行索引，列索引，也可以同时改变两者。

=fill method= 只对行重新索引有效，不适用列。

[[reindex][reindex 方法的参数]]

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  df = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=list('acd'),
                    columns=['Ohio', 'Texas', 'California'])
  log("df", df)
  # 重建行索引
  log("df.reindex(['a', 'b', 'c', 'd'])", df.reindex(['a', 'b', 'c', 'd']))
  # 重建列索引
  states = ['Texas', 'Utah', 'California']
  log("df.reindex(columns=states)", df.reindex(columns=states))
#+END_SRC

#+RESULTS:
#+begin_example
====================================== df ======================================
   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
======================= df.reindex(['a', 'b', 'c', 'd']) =======================
   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0
========================== df.reindex(columns=states) ==========================
   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8
#+end_example


**** 索引对齐

行和列都会执行对齐操作

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
                     columns=list('bcd'),
                     index=['Ohio', 'Texas', 'Colorado'])

  df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

  log("df1", df1)
  log("df2", df2)
  log("df1 + df2", df1 + df2)
#+END_SRC

