python3/pandas_v2.html


<div id="outline-container-org80db341" class="outline-4">
<h4 id="org80db341"><span class="section-number-4">1.4.1</span> 数据创建</h4>
</div>


<div id="outline-container-orgac1c340" class="outline-4">
<h4 id="orgac1c340"><span class="section-number-4">1.4.2</span> 数据操作</h4>
<div class="outline-text-4" id="text-1-4-2">
</div>
<div id="outline-container-orga9717ae" class="outline-5">
<h5 id="orga9717ae"><span class="section-number-5">1.4.2.1</span> 转置</h5>
<div class="outline-text-5" id="text-1-4-2-1">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">data</span> = {<span style="color: #e6db74;">'Nevada'</span>: {2001: 2.4, 2002: 2.9},
        <span style="color: #e6db74;">'Ohio'</span>: {2001: 1.5, 2001: 1.7, 2002: 3.6}}
<span style="color: #fd971f;">df</span> = pd.DataFrame(data)
log(<span style="color: #e6db74;">"df"</span>, df)
log(<span style="color: #e6db74;">"df.T"</span>, df.T)
</pre>
</div>

<pre class="example">
====================================== df ======================================
      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
===================================== df.T =====================================
        2001  2002
Nevada   2.4   2.9
Ohio     1.7   3.6

</pre>
</div>
</div>


<div id="outline-container-orgc5df83a" class="outline-5">
<h5 id="orgc5df83a"><span class="section-number-5">1.4.2.2</span> 设置行/列索引的 name 属性</h5>
<div class="outline-text-5" id="text-1-4-2-2">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">data</span> = {<span style="color: #e6db74;">'Nevada'</span>: {2001: 2.4, 2002: 2.9},
        <span style="color: #e6db74;">'Ohio'</span>: {2001: 1.5, 2001: 1.7, 2002: 3.6}}
<span style="color: #fd971f;">df</span> = pd.DataFrame(data)
<span style="color: #fd971f;">df.index.name</span> = <span style="color: #e6db74;">'year'</span>
<span style="color: #fd971f;">df.columns.name</span> = <span style="color: #e6db74;">'state'</span>
log(<span style="color: #e6db74;">"df"</span>, df)
</pre>
</div>

<pre class="example">
====================================== df ======================================
state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6

</pre>
</div>
</div>


<div id="outline-container-org6bf11d3" class="outline-5">
<h5 id="org6bf11d3"><span class="section-number-5">1.4.2.3</span> 列赋值</h5>
<div class="outline-text-5" id="text-1-4-2-3">
<p>
当将列表或数组赋值给一个列时，长度必须和 DataFrame 的长度相匹配。
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">data</span> = {<span style="color: #e6db74;">'state'</span>: [<span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Nevada'</span>, <span style="color: #e6db74;">'Nevada'</span>, <span style="color: #e6db74;">'Nevada'</span>],
        <span style="color: #e6db74;">'year'</span>: [2000, 2001, 2002, 2001, 2002, 2003],
        <span style="color: #e6db74;">'pop'</span>: [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
<span style="color: #fd971f;">columns</span> = [<span style="color: #e6db74;">'year'</span>, <span style="color: #e6db74;">'state'</span>, <span style="color: #e6db74;">'pop'</span>]
<span style="color: #fd971f;">index</span> = [<span style="color: #e6db74;">'one'</span>, <span style="color: #e6db74;">'two'</span>, <span style="color: #e6db74;">'three'</span>, <span style="color: #e6db74;">'four'</span>, <span style="color: #e6db74;">'five'</span>, <span style="color: #e6db74;">'six'</span>]
<span style="color: #fd971f;">df</span> = pd.DataFrame(data, columns=columns, index=index)
<span style="color: #fd971f;">df</span>[<span style="color: #e6db74;">'debt'</span>] = 16.5 <span style="color: #465457;"># </span><span style="color: #465457;">&#26631;&#37327;&#36171;&#20540;</span>
<span style="color: #fd971f;">df</span>[<span style="color: #e6db74;">'income'</span>] = np.arange(6.) <span style="color: #465457;"># </span><span style="color: #465457;">&#25968;&#32452;&#36171;&#20540;</span>
log(<span style="color: #e6db74;">"df"</span>, df)
</pre>
</div>

<pre class="example">
====================================== df ======================================
       year   state  pop  debt  income
one    2000    Ohio  1.5  16.5     0.0
two    2001    Ohio  1.7  16.5     1.0
three  2002    Ohio  3.6  16.5     2.0
four   2001  Nevada  2.4  16.5     3.0
five   2002  Nevada  2.9  16.5     4.0
six    2003  Nevada  3.2  16.5     5.0

</pre>


<p>
将 Series 赋值给一列时，Series 的索引会按照 DataFrame 的索引重新排列。
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">val</span> = pd.Series([-1.2, -1.5, -1.7], index=[<span style="color: #e6db74;">'two'</span>, <span style="color: #e6db74;">'four'</span>, <span style="color: #e6db74;">'five'</span>])
<span style="color: #fd971f;">df</span>[<span style="color: #e6db74;">'debt'</span>] = val
log(<span style="color: #e6db74;">"df"</span>, df)
</pre>
</div>

<pre class="example">
====================================== df ======================================
       year   state  pop  debt  income
one    2000    Ohio  1.5   NaN     0.0
two    2001    Ohio  1.7  -1.2     1.0
three  2002    Ohio  3.6   NaN     2.0
four   2001  Nevada  2.4  -1.5     3.0
five   2002  Nevada  2.9  -1.7     4.0
six    2003  Nevada  3.2   NaN     5.0

</pre>
</div>
</div>


<div id="outline-container-org4611599" class="outline-5">
<h5 id="org4611599"><span class="section-number-5">1.4.2.4</span> 删除列</h5>
<div class="outline-text-5" id="text-1-4-2-4">
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">data</span> = {<span style="color: #e6db74;">'state'</span>: [<span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Nevada'</span>, <span style="color: #e6db74;">'Nevada'</span>, <span style="color: #e6db74;">'Nevada'</span>],
        <span style="color: #e6db74;">'year'</span>: [2000, 2001, 2002, 2001, 2002, 2003],
        <span style="color: #e6db74;">'pop'</span>: [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
<span style="color: #fd971f;">columns</span> = [<span style="color: #e6db74;">'year'</span>, <span style="color: #e6db74;">'state'</span>, <span style="color: #e6db74;">'pop'</span>]
<span style="color: #fd971f;">index</span> = [<span style="color: #e6db74;">'one'</span>, <span style="color: #e6db74;">'two'</span>, <span style="color: #e6db74;">'three'</span>, <span style="color: #e6db74;">'four'</span>, <span style="color: #e6db74;">'five'</span>, <span style="color: #e6db74;">'six'</span>]
<span style="color: #fd971f;">df</span> = pd.DataFrame(data, columns=columns, index=index)
<span style="color: #f92672; font-weight: bold;">del</span> df[<span style="color: #e6db74;">'pop'</span>]
<span style="color: #fd971f;">yearSeries</span> = df.pop(<span style="color: #e6db74;">'year'</span>)
df.drop(<span style="color: #e6db74;">'state'</span>, axis=<span style="color: #e6db74;">'columns'</span>, inplace=<span style="color: #ae81ff;">True</span>)
log(<span style="color: #e6db74;">"df"</span>, df)
</pre>
</div>

<pre class="example">
====================================== df ======================================
Empty DataFrame
Columns: []
Index: [one, two, three, four, five, six]

</pre>
</div>
</div>
</div>



<div id="outline-container-org0195e46" class="outline-4">
<h4 id="org0195e46"><span class="section-number-4">1.4.3</span> 数据索引</h4>
<div class="outline-text-4" id="text-1-4-3">
</div>
<div id="outline-container-orgd2f9e97" class="outline-5">
<h5 id="orgd2f9e97"><span class="section-number-5">1.4.3.1</span> 重建索引</h5>
<div class="outline-text-5" id="text-1-4-3-1">
<p>
在 DataFrame 中， <code>reindex</code> 可以改变行索引，列索引，也可以同时改变两者。
</p>

<p>
<code>fill method</code> 只对行重新索引有效，不适用列。
</p>

<p>
<a href="#orge8a9db5">reindex 方法的参数</a>
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">df</span> = pd.DataFrame(np.arange(9).reshape((3,3)),
                  index=<span style="color: #a6e22e;">list</span>(<span style="color: #e6db74;">'acd'</span>),
                  columns=[<span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Texas'</span>, <span style="color: #e6db74;">'California'</span>])
log(<span style="color: #e6db74;">"df"</span>, df)
<span style="color: #465457;"># </span><span style="color: #465457;">&#37325;&#24314;&#34892;&#32034;&#24341;</span>
log(<span style="color: #e6db74;">"df.reindex(['a', 'b', 'c', 'd'])"</span>, df.reindex([<span style="color: #e6db74;">'a'</span>, <span style="color: #e6db74;">'b'</span>, <span style="color: #e6db74;">'c'</span>, <span style="color: #e6db74;">'d'</span>]))
<span style="color: #465457;"># </span><span style="color: #465457;">&#37325;&#24314;&#21015;&#32034;&#24341;</span>
<span style="color: #fd971f;">states</span> = [<span style="color: #e6db74;">'Texas'</span>, <span style="color: #e6db74;">'Utah'</span>, <span style="color: #e6db74;">'California'</span>]
log(<span style="color: #e6db74;">"df.reindex(columns=states)"</span>, df.reindex(columns=states))
</pre>
</div>

<pre class="example">
====================================== df ======================================
   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
======================= df.reindex(['a', 'b', 'c', 'd']) =======================
   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0
========================== df.reindex(columns=states) ==========================
   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8
</pre>
</div>
</div>
