python3/pandas_v2.org
**** 列标签索引

从 DataFrame 中玄虚的列是数据的 _视图_ ，而不是拷贝。
如果需要复制，应当显式地使用 Series 的 =copy= 方法。

返回的 Series 与原 DataFrame 有相同的索引，且 Series 的 =name= 属性也会被合理地设置。

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
          'year': [2000, 2001, 2002, 2001, 2002, 2003],
          'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
  columns = ['year', 'state', 'pop']
  df = pd.DataFrame(data, columns=columns)
  log("df", df)
  log("df['state']", df['state'])
  log("df.year", df.year)
  log("df[['state', 'pop']]", df[['state', 'pop']])
#+END_SRC

#+RESULTS:
#+begin_example
====================================== df ======================================
   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2
================================= df['state'] ==================================
0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object
=================================== df.year ====================================
0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64
============================= df[['state', 'pop']] =============================
    state  pop
0    Ohio  1.5
1    Ohio  1.7
2    Ohio  3.6
3  Nevada  2.4
4  Nevada  2.9
5  Nevada  3.2
#+end_example


**** 行整数索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
  log("df", df)
  log("df[:2]", df[:2])
#+END_SRC

#+RESULTS:
#+begin_example
====================================== df ======================================
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
==================================== df[:2] ====================================
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
#+end_example


**** 行布尔索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
  log("df", df)
  log("df[df['three'] > 5]", df[df['three'] > 5])
#+END_SRC

#+RESULTS:
#+begin_example
====================================== df ======================================
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
============================= df[df['three'] > 5] ==============================
          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
#+end_example


**** loc 索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
  log("df", df)
  log("df.loc['Colorado', ['two', 'three']]", df.loc['Colorado', ['two', 'three']])
  log("df.loc[:'Utah', 'two']", df.loc[:'Utah', 'two'])
#+END_SRC

#+RESULTS:
#+begin_example
====================================== df ======================================
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
===================== df.loc['Colorado', ['two', 'three']] =====================
two      5
three    6
Name: Colorado, dtype: int64
============================ df.loc[:'Utah', 'two'] ============================
Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64
#+end_example

**** iloc 索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
  log("df", df)
  log("df.iloc[2, [3, 0, 1]]", df.iloc[2, [3, 0, 1]])
  log("df.iloc[[1, 2], [3, 0, 1]]", df.iloc[[1, 2], [3, 0, 1]])
  log("df.iloc[:, :3][df.three > 5]", df.iloc[:, :3][df.three > 5])
#+END_SRC

#+RESULTS:
#+begin_example
====================================== df ======================================
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
============================ df.iloc[2, [3, 0, 1]] =============================
four    11
one      8
two      9
Name: Utah, dtype: int64
========================== df.iloc[[1, 2], [3, 0, 1]] ==========================
          four  one  two
Colorado     7    4    5
Utah        11    8    9
========================= df.iloc[:, :3][df.three > 5] =========================
          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14
#+end_example

**** 删除索引

#+BEGIN_SRC ipython :session :exports both :results output :eval never-export
  df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
  log("df", df)
  log("df.drop('Colorado')", df.drop('Colorado'))
  log("df.drop('two', axis='columns')", df.drop('two', axis='columns'))
#+END_SRC

#+RESULTS:
#+begin_example
====================================== df ======================================
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
============================= df.drop('Colorado') ==============================
          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15
======================== df.drop('two', axis='columns') ========================
          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15
#+end_example


* 附录

** reindex 方法的参数 <<reindex>>

- method

  插值方式， =ffill= 为前向填充， =bfill= 是后向填充

- fill_value

- limit

  前向或后向填充时，所需填充的最大尺寸间隙（以元素数量）

- tolerance

  前向或后向填充时，所需填充的不精确匹配下的最大尺寸间隙（以绝对数字距离）

- level

  匹配 MultiIndex 级别的简单索引；否则选择子集

- copy

  如果为 =True= ，即使新索引等于旧索引，也总是复制底层数据；
  如果是 =False= ，则在索引相同时不复制数据


** 索引对象常见方法和属性 <<index obj>>

- append
- difference
- intersection
- union
- isin
- delete
- drop
- insert
- is_monotonic
- is_unique
- unique
