python3/pandas_v2.html


<div id="outline-container-org8cca113" class="outline-5">
<h5 id="org8cca113"><span class="section-number-5">1.4.3.2</span> 列索引</h5>
<div class="outline-text-5" id="text-1-4-3-2">
<p>
从 DataFrame 中玄虚的列是数据的 <span class="underline">视图</span> ，而不是拷贝。
如果需要复制，应当显式地使用 Series 的 <code>copy</code> 方法。
</p>

<p>
返回的 Series 与原 DataFrame 有相同的索引，且 Series 的 <code>name</code> 属性也会被合理地设置。
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #fd971f;">data</span> = {<span style="color: #e6db74;">'state'</span>: [<span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Ohio'</span>, <span style="color: #e6db74;">'Nevada'</span>, <span style="color: #e6db74;">'Nevada'</span>, <span style="color: #e6db74;">'Nevada'</span>],
        <span style="color: #e6db74;">'year'</span>: [2000, 2001, 2002, 2001, 2002, 2003],
        <span style="color: #e6db74;">'pop'</span>: [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
<span style="color: #fd971f;">columns</span> = [<span style="color: #e6db74;">'year'</span>, <span style="color: #e6db74;">'state'</span>, <span style="color: #e6db74;">'pop'</span>]
<span style="color: #fd971f;">df</span> = pd.DataFrame(data, columns=columns)
log(<span style="color: #e6db74;">"df"</span>, df)
log(<span style="color: #e6db74;">"df['state']"</span>, df[<span style="color: #e6db74;">'state'</span>])
log(<span style="color: #e6db74;">"df.year"</span>, df.year)
</pre>
</div>

<pre class="example">
====================================== df ======================================
   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2
================================= df['state'] ==================================
0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object
=================================== df.year ====================================
0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64
</pre>
</div>
</div>
</div>
</div>
</div>




<div id="outline-container-org0a05c46" class="outline-2">
<h2 id="org0a05c46"><span class="section-number-2">2</span> 附录</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8a299ea" class="outline-3">
<h3 id="org8a299ea"><span class="section-number-3">2.1</span> reindex 方法的参数 <a id="orge8a9db5"></a></h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><p>
method
</p>

<p>
插值方式， <code>ffill</code> 为前向填充， <code>bfill</code> 是后向填充
</p></li>

<li>fill_value</li>

<li><p>
limit
</p>

<p>
前向或后向填充时，所需填充的最大尺寸间隙（以元素数量）
</p></li>

<li><p>
tolerance
</p>

<p>
前向或后向填充时，所需填充的不精确匹配下的最大尺寸间隙（以绝对数字距离）
</p></li>

<li><p>
level
</p>

<p>
匹配 MultiIndex 级别的简单索引；否则选择子集
</p></li>

<li><p>
copy
</p>

<p>
如果为 <code>True</code> ，即使新索引等于旧索引，也总是复制底层数据；
如果是 <code>False</code> ，则在索引相同时不复制数据
</p></li>
</ul>
</div>
</div>


<div id="outline-container-orgcf89d46" class="outline-3">
<h3 id="orgcf89d46"><span class="section-number-3">2.2</span> 索引对象常见方法和属性 <a id="org9629cb1"></a></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>append</li>
<li>difference</li>
<li>intersection</li>
<li>union</li>
<li>isin</li>
<li>delete</li>
<li>drop</li>
<li>insert</li>
<li>is_monotonic</li>
<li>is_unique</li>
<li>unique</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>